{"HeWeather data service 3.0":
	[
	{"aqi":
		{
		"city":{"aqi":"66","pm10":"80","pm25":"39"}
		},
	"basic":
		{"city":"嘉定","cnty":"中国","id":"CN101020500","lat":"31.363000","lon":"121.263000",
				"update":{"loc":"2016-04-26 09:49","utc":"2016-04-26 01:49"}
		},
	"daily_forecast":
		[
			{
			"astro":
				{"mr":"22:01","ms":"08:00","sr":"05:14","ss":"18:31"},
			"cond":
				{"code_d":"305","code_n":"306","txt_d":"小雨","txt_n":"中雨"},
			"date":"2016-04-26",
			"hum":"75",
			"pcpn":"1.3",
			"pop":"56",
			"pres":"1011",
			"tmp":{"max":"18","min":"14"},
			"vis":"10",
			"wind":	{"deg":"122","dir":"东风","sc":"微风","spd":"9"}
			},

			{
			"astro":
				{"mr":"22:50","ms":"08:48","sr":"05:13","ss":"18:31"},
			"cond":
				{"code_d":"305","code_n":"104","txt_d":"小雨","txt_n":"阴"},
			"date":"2016-04-27","hum":"68",
				"pcpn":"1.0","pop":"88","pres":"1010",
				"tmp":{"max":"17","min":"12"},
				"vis":"10",
				"wind":{"deg":"336","dir":"北风","sc":"微风","spd":"7"}
				},

			{
				"astro":
					{"mr":"23:39","ms":"09:39","sr":"05:12","ss":"18:32"},
				"cond":
					{"code_d":"101","code_n":"101","txt_d":"多云","txt_n":"多云"},
				"date":"2016-04-28",
				"hum":"59",
				"pcpn":"0.0",
				"pop":"12",
				"pres":"1014",
				"tmp":
					{"max":"22","min":"13"},
				"vis":"10",
				"wind":{"deg":"17","dir":"北风","sc":"微风","spd":"6"}
				},
				
			{
				"astro":
					{"mr":"null","ms":"10:33","sr":"05:11","ss":"18:33"},
				"cond":
					{"code_d":"101","code_n":"104","txt_d":"多云","txt_n":"阴"},
				"date":"2016-04-29",
				"hum":"43",
				"pcpn":"0.0",
				"pop":"0",
				"pres":"1015",
				"tmp":{"max":"25","min":"16"},
				"vis":"10",
				"wind":{"deg":"61","dir":"北风","sc":"微风","spd":"6"}
			},
				
			{
				"astro":{"mr":"00:24","ms":"11:31","sr":"05:10","ss":"18:33"},
				"cond":{"code_d":"101","code_n":"104","txt_d":"多云","txt_n":"阴"},
				"date":"2016-04-30",
				"hum":"41","pcpn":"0.0","pop":"0","pres":"1010",
				"tmp":{"max":"27","min":"16"},"vis":"10",
				"wind":{"deg":"170","dir":"东南风","sc":"微风","spd":"5"}
				},
				
			{
				"astro":{"mr":"01:09","ms":"12:31","sr":"05:09","ss":"18:34"},
				"cond":{"code_d":"104","code_n":"104","txt_d":"阴","txt_n":"阴"},
				"date":"2016-05-01","hum":"66","pcpn":"0.0","pop":"3","pres":"1009",
				"tmp":{"max":"25","min":"18"},"vis":"10",
				"wind":{"deg":"159","dir":"南风","sc":"微风","spd":"10"}
				},

			{
				"astro":{"mr":"01:51","ms":"13:34","sr":"05:08","ss":"18:35"},
				"cond":{"code_d":"104","code_n":"307","txt_d":"阴","txt_n":"大雨"},
				"date":"2016-05-02","hum":"63","pcpn":"1.4","pop":"43","pres":"1006",
				"tmp":{"max":"25","min":"17"},"vis":"10",
				"wind":{"deg":"134","dir":"南风","sc":"微风","spd":"3"}
				}
			],//daily-forst数组
		"hourly_forecast":
			[
				{
				"date":"2016-04-26 10:00","hum":"74","pop":"3","pres":"1013","tmp":"19",
				"wind":{"deg":"122","dir":"东南风","sc":"3-4","spd":"21"}
				},
						{"date":"2016-04-26 13:00","hum":"75","pop":"34","pres":"1012","tmp":"20",
						"wind":{"deg":"123","dir":"东南风","sc":"3-4","spd":"18"}
					},
						{"date":"2016-04-26 16:00","hum":"84","pop":"54","pres":"1011","tmp":"18",
						"wind":{"deg":"79","dir":"东风","sc":"3-4","spd":"21"}
					},
						{"date":"2016-04-26 19:00","hum":"88","pop":"55","pres":"1011","tmp":"15",
						"wind":{"deg":"57","dir":"东北风","sc":"3-4","spd":"22"}
					},
						{"date":"2016-04-26 22:00","hum":"87","pop":"20","pres":"1012","tmp":"12",
						"wind":{"deg":"63","dir":"东北风","sc":"3-4","spd":"18"}
					}
			],//hourly-forst数组

		"now":{
				"cond":{"code":"300","txt":"阵雨"},
				"fl":"16","hum":"87","pcpn":".1","pres":"1012","tmp":"16","vis":"8",
				"wind":{"deg":"120","dir":"东风","sc":"5-6","spd":"27"}
					},"status":"ok",
					"suggestion":{"comf":{"brf":"舒适","txt":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},
							"cw":{"brf":"不宜","txt":"不宜洗车，未来24小时内有雨，如果在此期间洗车，雨水和路上的泥水可能会再次弄脏您的爱车。"},
							"drsg":{"brf":"较冷","txt":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"},
							"flu":{"brf":"易发","txt":"天冷空气湿度大，易发生感冒，请注意适当增加衣服，加强自我防护避免感冒。"},
							"sport":{"brf":"较不宜","txt":"有降水，推荐您在室内进行各种健身休闲运动，若坚持户外运动，须注意保暖并携带雨具。"},
							"trav":{"brf":"适宜","txt":"温度适宜，又有较弱降水和微风作伴，会给您的旅行带来意想不到的景象，适宜旅游，可不要错过机会呦！"},
					"uv":{"brf":"最弱","txt":"属弱紫外线辐射天气，无需特别防护。若长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"}
									}
			}
	]
}